# Ultralytics YOLO11n-Ghost for Pothole Detection
# =================================================
# Replaces C3k2 (YOLO11 block) with C3Ghost (Lightweight)
# Replaces Conv with GhostConv (Speed)

# Parameters
nc: 1 # number of classes (pothole)
scales: # model compound scaling constants for YOLO11n (Depth 0.50, Width 0.25)
  n: [0.50, 0.25, 1024] 

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]             # 0-P1/2 (Keep stem standard for stability)
  - [-1, 1, GhostConv, [128, 3, 2]]       # 1-P2/4
  - [-1, 2, C3Ghost, [256, False]]        # 2
  - [-1, 1, GhostConv, [256, 3, 2]]       # 3-P3/8
  - [-1, 2, C3Ghost, [512, False]]        # 4 (Output P3)
  - [-1, 1, GhostConv, [512, 3, 2]]       # 5-P4/16
  - [-1, 2, C3Ghost, [512, True]]         # 6 (Output P4)
  - [-1, 1, GhostConv, [1024, 3, 2]]      # 7-P5/32
  - [-1, 2, C3Ghost, [1024, True]]        # 8 (Output P5)
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 2, C2PSA, [1024]]                # 10 (YOLO11 Attention Block - Keep for accuracy)

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]             # cat backbone P4
  - [-1, 2, C3Ghost, [512, False]]        # 13

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]             # cat backbone P3
  - [-1, 2, C3Ghost, [256, False]]        # 16 (P3/8-small)

  - [-1, 1, GhostConv, [256, 3, 2]]       # Downsample
  - [[-1, 13], 1, Concat, [1]]            # cat head P4
  - [-1, 2, C3Ghost, [512, False]]        # 19 (P4/16-medium)

  - [-1, 1, GhostConv, [512, 3, 2]]       # Downsample
  - [[-1, 10], 1, Concat, [1]]            # cat head P5
  - [-1, 2, C3Ghost, [1024, True]]        # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]]       # Detect(P3, P4, P5)